<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Imports" data-toc-modified-id="Imports-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Imports</a></span></li><li><span><a href="#Create-Tables" data-toc-modified-id="Create-Tables-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Create Tables</a></span></li><li><span><a href="#Wikibooks-SQL-Exercise:-Employee-management" data-toc-modified-id="Wikibooks-SQL-Exercise:-Employee-management-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Wikibooks SQL Exercise: Employee management</a></span><ul class="toc-item"><li><span><a href="#data:-Warehouses" data-toc-modified-id="data:-Warehouses-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>data: Warehouses</a></span></li><li><span><a href="#data:-Boxes" data-toc-modified-id="data:-Boxes-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>data: Boxes</a></span></li><li><span><a href="#data:-combined-data" data-toc-modified-id="data:-combined-data-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>data: combined data</a></span></li><li><span><a href="#merge-two-dataframes-using-pyspark" data-toc-modified-id="merge-two-dataframes-using-pyspark-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>merge two dataframes using pyspark</a></span></li><li><span><a href="#spark-dataframe-attributes" data-toc-modified-id="spark-dataframe-attributes-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>spark dataframe attributes</a></span></li></ul></li><li><span><a href="#Create-SQL-table-from-spark-dataframes" data-toc-modified-id="Create-SQL-table-from-spark-dataframes-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Create SQL table from spark dataframes</a></span></li><li><span><a href="#Exercise-Questions" data-toc-modified-id="Exercise-Questions-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Exercise Questions</a></span><ul class="toc-item"><li><span><a href="#1.-Select-all-warehouses." data-toc-modified-id="1.-Select-all-warehouses.-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>1. Select all warehouses.</a></span></li><li><span><a href="#2.-Select-all-boxes-with-a-value-larger-than-150." data-toc-modified-id="2.-Select-all-boxes-with-a-value-larger-than-150.-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>2. Select all boxes with a value larger than 150.</a></span></li><li><span><a href="#3.-Select-all-distinct-contents-in-all-the-boxes." data-toc-modified-id="3.-Select-all-distinct-contents-in-all-the-boxes.-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>3. Select all distinct contents in all the boxes.</a></span></li><li><span><a href="#4.-Select-the-average-value-of-all-the-boxes." data-toc-modified-id="4.-Select-the-average-value-of-all-the-boxes.-5.4"><span class="toc-item-num">5.4&nbsp;&nbsp;</span>4. Select the average value of all the boxes.</a></span></li><li><span><a href="#5.-Select-the-warehouse-code-and-the-average-value-of-the-boxes-in-each-warehouse." data-toc-modified-id="5.-Select-the-warehouse-code-and-the-average-value-of-the-boxes-in-each-warehouse.-5.5"><span class="toc-item-num">5.5&nbsp;&nbsp;</span>5. Select the warehouse code and the average value of the boxes in each warehouse.</a></span></li><li><span><a href="#6.-Same-as-previous-exercise,-but-select-only-those-warehouses-where-the-average-value-of-the-boxes-is-greater-than-150." data-toc-modified-id="6.-Same-as-previous-exercise,-but-select-only-those-warehouses-where-the-average-value-of-the-boxes-is-greater-than-150.-5.6"><span class="toc-item-num">5.6&nbsp;&nbsp;</span>6. Same as previous exercise, but select only those warehouses where the average value of the boxes is greater than 150.</a></span></li><li><span><a href="#7.-Select-the-code-of-each-box,-along-with-the-name-of-the-city-the-box-is-located-in." data-toc-modified-id="7.-Select-the-code-of-each-box,-along-with-the-name-of-the-city-the-box-is-located-in.-5.7"><span class="toc-item-num">5.7&nbsp;&nbsp;</span>7. Select the code of each box, along with the name of the city the box is located in.</a></span></li><li><span><a href="#8.-Select-the-warehouse-codes,-along-with-the-number-of-boxes-in-each-warehouse.-Optionally,-take-into-account-that-some-warehouses-are-empty-(i.e.,-the-box-count-should-show-up-as-zero,-instead-of-omitting-the-warehouse-from-the-result)." data-toc-modified-id="8.-Select-the-warehouse-codes,-along-with-the-number-of-boxes-in-each-warehouse.-Optionally,-take-into-account-that-some-warehouses-are-empty-(i.e.,-the-box-count-should-show-up-as-zero,-instead-of-omitting-the-warehouse-from-the-result).-5.8"><span class="toc-item-num">5.8&nbsp;&nbsp;</span>8. Select the warehouse codes, along with the number of boxes in each warehouse. Optionally, take into account that some warehouses are empty (i.e., the box count should show up as zero, instead of omitting the warehouse from the result).</a></span></li><li><span><a href="#9.-Select-the-codes-of-all-warehouses-that-are-saturated-(a-warehouse-is-saturated-if-the-number-of-boxes-in-it-is-larger-than-the-warehouse's-capacity)." data-toc-modified-id="9.-Select-the-codes-of-all-warehouses-that-are-saturated-(a-warehouse-is-saturated-if-the-number-of-boxes-in-it-is-larger-than-the-warehouse's-capacity).-5.9"><span class="toc-item-num">5.9&nbsp;&nbsp;</span>9. Select the codes of all warehouses that are saturated (a warehouse is saturated if the number of boxes in it is larger than the warehouse's capacity).</a></span></li><li><span><a href="#10.-Select-the-codes-of-all-the-boxes-located-in-Chicago." data-toc-modified-id="10.-Select-the-codes-of-all-the-boxes-located-in-Chicago.-5.10"><span class="toc-item-num">5.10&nbsp;&nbsp;</span>10. Select the codes of all the boxes located in Chicago.</a></span></li><li><span><a href="#11.-Create-a-new-warehouse-in-New-York-with-a-capacity-for-3-boxes." data-toc-modified-id="11.-Create-a-new-warehouse-in-New-York-with-a-capacity-for-3-boxes.-5.11"><span class="toc-item-num">5.11&nbsp;&nbsp;</span>11. Create a new warehouse in New York with a capacity for 3 boxes.</a></span></li><li><span><a href="#12.-Create-a-new-box,-with-code-&quot;H5RT&quot;,-containing-&quot;Papers&quot;-with-a-value-of-200,-and-located-in-warehouse-2." data-toc-modified-id="12.-Create-a-new-box,-with-code-&quot;H5RT&quot;,-containing-&quot;Papers&quot;-with-a-value-of-200,-and-located-in-warehouse-2.-5.12"><span class="toc-item-num">5.12&nbsp;&nbsp;</span>12. Create a new box, with code "H5RT", containing "Papers" with a value of 200, and located in warehouse 2.</a></span></li><li><span><a href="#13.-Reduce-the-value-of-all-boxes-by-15%." data-toc-modified-id="13.-Reduce-the-value-of-all-boxes-by-15%.-5.13"><span class="toc-item-num">5.13&nbsp;&nbsp;</span>13. Reduce the value of all boxes by 15%.</a></span></li><li><span><a href="#14.-Apply-a-20%-value-reduction-to-boxes-with-a-value-larger-than-the-average-value-of-all-the-boxes." data-toc-modified-id="14.-Apply-a-20%-value-reduction-to-boxes-with-a-value-larger-than-the-average-value-of-all-the-boxes.-5.14"><span class="toc-item-num">5.14&nbsp;&nbsp;</span>14. Apply a 20% value reduction to boxes with a value larger than the average value of all the boxes.</a></span></li><li><span><a href="#15.-Remove-all-boxes-with-a-value-lower-than-100." data-toc-modified-id="15.-Remove-all-boxes-with-a-value-lower-than-100.-5.15"><span class="toc-item-num">5.15&nbsp;&nbsp;</span>15. Remove all boxes with a value lower than 100.</a></span></li><li><span><a href="#16.-Remove-all-boxes-from-saturated-warehouses." data-toc-modified-id="16.-Remove-all-boxes-from-saturated-warehouses.-5.16"><span class="toc-item-num">5.16&nbsp;&nbsp;</span>16. Remove all boxes from saturated warehouses.</a></span></li></ul></li></ul></div>

# Imports

- https://en.wikibooks.org/wiki/SQL_Exercises
- https://en.wikibooks.org/wiki/SQL_Exercises/The_warehouse

In [1]:
import time
time_start_notebook = time.time()

In [2]:
from bhishan import bp # my personal library

/Users/poudel/miniconda3/envs/dataSc/lib/python3.7/site-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [3]:
import numpy as np
import pandas as pd

import functools # reduce

In [4]:
# pyspark
import pyspark
spark = pyspark.sql.SparkSession.builder.appName('bhishan').getOrCreate()
print([(x.__name__,x.__version__) for x in [np, pd, pyspark]])

# sql
# sql
from pyspark.sql.functions import col as _col
from pyspark.sql.functions import udf # @udf("integer") def myfunc(x,y): return x - y
from pyspark.sql import functions as F # stddev format_number date_format, dayofyear, when
from pyspark.sql.window import Window

from pyspark.sql.functions import (mean as _mean, min as _min,
                                   max as _max, avg as _avg,
                                   when as _when
                                  )

from pyspark.sql.types import StructField, StringType, IntegerType,  FloatType, StructType

[('numpy', '1.18.1'), ('pandas', '1.0.1'), ('pyspark', '2.4.4')]

In [126]:
from pyspark import SparkConf, SparkContext, SQLContext

spark = pyspark.sql.SparkSession.builder.appName('app').getOrCreate()
sc = spark.sparkContext
sqlContext = SQLContext(sc) # spark_df = sqlContext.createDataFrame(pandas_df)
sc.setLogLevel("INFO")

In [6]:
import os
import yaml

with open( os.path.expanduser('~') + "/.postgres_conf.yml", 'r') as stream:
    try:
        yaml_dict = yaml.safe_load(stream)
    except yaml.YAMLError as exc:
        print(exc)

pw = yaml_dict['password']

In [7]:
%load_ext sql

In [8]:
%sql postgres://postgres:$pw@localhost:5432/dvdrental

'Connected: postgres@dvdrental'

# Create Tables

In [9]:
'''

We do it only once.

%%sql

 CREATE TABLE Warehouses (
   Code INTEGER PRIMARY KEY NOT NULL,
   Location TEXT NOT NULL ,
   Capacity INTEGER NOT NULL 
 );
 
 CREATE TABLE Boxes (
   Code TEXT PRIMARY KEY NOT NULL,
   Contents TEXT NOT NULL ,
   Value REAL NOT NULL ,
   Warehouse INTEGER NOT NULL, 
   CONSTRAINT fk_Warehouses_Code FOREIGN KEY (Warehouse) REFERENCES Warehouses(Code)
 );

'''

 * postgres://postgres:***@localhost:5432/dvdrental
Done.
Done.

[]

In [13]:
'''
We do it only once.

%%sql
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(1,'Chicago',3);
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(2,'Chicago',4);
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(3,'New York',7);
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(4,'Los Angeles',2);
INSERT INTO Warehouses(Code,Location,Capacity) VALUES(5,'San Francisco',8);

INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('0MN7','Rocks',180,3);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('4H8P','Rocks',250,1);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('4RT3','Scissors',190,4);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('7G3H','Rocks',200,1);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('8JN6','Papers',75,1);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('8Y6U','Papers',50,3);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('9J6F','Papers',175,2);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('LL08','Rocks',140,4);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('P0H6','Scissors',125,1);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('P2T6','Scissors',150,2);
INSERT INTO Boxes(Code,Contents,Value,Warehouse) VALUES('TU55','Papers',90,5);

''';

# Wikibooks SQL Exercise: Employee management
Relational Schema  
(Right click the image, inspect and copy the element)  


<img alt="Sql warehouse.png" src="//upload.wikimedia.org/wikipedia/commons/4/47/Sql_warehouse.png" decoding="async" width="605" height="97" data-file-width="605" data-file-height="97">

## data: Warehouses

In [14]:
%%sql
select * from Warehouses;

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(1, 'Chicago', 3),
 (2, 'Chicago', 4),
 (3, 'New York', 7),
 (4, 'Los Angeles', 2),
 (5, 'San Francisco', 8)]

In [15]:
dfw = pd.DataFrame({'code': [1, 2, 3, 4, 5],
          'location': ['Chicago', 'Chicago', 'New York', 'Los Angeles', 'San Francisco'],
          'capacity': [3, 4, 7, 2, 8]})
dfw

   code       location  capacity
0     1        Chicago         3
1     2        Chicago         4
2     3       New York         7
3     4    Los Angeles         2
4     5  San Francisco         8

In [16]:
dfw.dtypes

code         int64
location    object
capacity     int64
dtype: object

In [17]:
schema = StructType([
    StructField('code',IntegerType(),True),
    StructField('location',StringType(),True),
    StructField('capacity',IntegerType(),True),
    ])

sdfw = sqlContext.createDataFrame(dfw, schema)
sdfw.show()

+----+-------------+--------+
|code|     location|capacity|
+----+-------------+--------+
|   1|      Chicago|       3|
|   2|      Chicago|       4|
|   3|     New York|       7|
|   4|  Los Angeles|       2|
|   5|San Francisco|       8|
+----+-------------+--------+

## data: Boxes

In [18]:
%%sql
select * from Boxes;

 * postgres://postgres:***@localhost:5432/dvdrental
11 rows affected.

[('0MN7', 'Rocks', 180.0, 3),
 ('4H8P', 'Rocks', 250.0, 1),
 ('4RT3', 'Scissors', 190.0, 4),
 ('7G3H', 'Rocks', 200.0, 1),
 ('8JN6', 'Papers', 75.0, 1),
 ('8Y6U', 'Papers', 50.0, 3),
 ('9J6F', 'Papers', 175.0, 2),
 ('LL08', 'Rocks', 140.0, 4),
 ('P0H6', 'Scissors', 125.0, 1),
 ('P2T6', 'Scissors', 150.0, 2),
 ('TU55', 'Papers', 90.0, 5)]

In [19]:
dfb = pd.DataFrame({'code': ['0MN7', '4H8P', '4RT3', '7G3H', '8JN6', '8Y6U', '9J6F', 'LL08', 'P0H6', 'P2T6', 'TU55'],
          'contents': ['Rocks', 'Rocks', 'Scissors', 'Rocks', 'Papers', 'Papers', 'Papers', 'Rocks', 'Scissors', 'Scissors', 'Papers'],
          'value': [180.0, 250.0, 190.0, 200.0, 75.0, 50.0, 175.0, 140.0, 125.0, 150.0, 90.0],
          'warehouse': [3, 1, 4, 1, 1, 3, 2, 4, 1, 2, 5]})
dfb

    code  contents  value  warehouse
0   0MN7     Rocks  180.0          3
1   4H8P     Rocks  250.0          1
2   4RT3  Scissors  190.0          4
3   7G3H     Rocks  200.0          1
4   8JN6    Papers   75.0          1
5   8Y6U    Papers   50.0          3
6   9J6F    Papers  175.0          2
7   LL08     Rocks  140.0          4
8   P0H6  Scissors  125.0          1
9   P2T6  Scissors  150.0          2
10  TU55    Papers   90.0          5

In [20]:
dfb.dtypes

code          object
contents      object
value        float64
warehouse      int64
dtype: object

In [23]:
schema = StructType([
    StructField('code',StringType(),True),
    StructField('contents',StringType(),True),
    StructField('value',FloatType(),True),
    StructField('warehouse',IntegerType(),True),

    ])

sdfb = sqlContext.createDataFrame(dfb, schema)
sdfb.show()

+----+--------+-----+---------+
|code|contents|value|warehouse|
+----+--------+-----+---------+
|0MN7|   Rocks|180.0|        3|
|4H8P|   Rocks|250.0|        1|
|4RT3|Scissors|190.0|        4|
|7G3H|   Rocks|200.0|        1|
|8JN6|  Papers| 75.0|        1|
|8Y6U|  Papers| 50.0|        3|
|9J6F|  Papers|175.0|        2|
|LL08|   Rocks|140.0|        4|
|P0H6|Scissors|125.0|        1|
|P2T6|Scissors|150.0|        2|
|TU55|  Papers| 90.0|        5|
+----+--------+-----+---------+

## data: combined data

In [42]:
df = dfw.merge(dfb,left_on='code', right_on='warehouse',suffixes=['_ware','_box'])
df

    code_ware       location  capacity code_box  contents  value  warehouse
0           1        Chicago         3     4H8P     Rocks  250.0          1
1           1        Chicago         3     7G3H     Rocks  200.0          1
2           1        Chicago         3     8JN6    Papers   75.0          1
3           1        Chicago         3     P0H6  Scissors  125.0          1
4           2        Chicago         4     9J6F    Papers  175.0          2
5           2        Chicago         4     P2T6  Scissors  150.0          2
6           3       New York         7     0MN7     Rocks  180.0          3
7           3       New York         7     8Y6U    Papers   50.0          3
8           4    Los Angeles         2     4RT3  Scissors  190.0          4
9           4    Los Angeles         2     LL08     Rocks  140.0          4
10          5  San Francisco         8     TU55    Papers   90.0          5

## merge two dataframes using pyspark

- we need to rename common columns of two tables.

In [43]:
cols_w = sdfw.columns
cols_b  = sdfb.columns
cols_common = set(cols_w) & set(cols_b)
cols_w, cols_b, cols_common

(['code', 'location', 'capacity'],
 ['code', 'contents', 'value', 'warehouse'],
 {'code'})

In [44]:
# rename common columns of first spark dataframe.

In [45]:
sdfw2 = sdfw.withColumnRenamed('code','code_ware')
sdfw2.show(2)

+---------+--------+--------+
|code_ware|location|capacity|
+---------+--------+--------+
|        1| Chicago|       3|
|        2| Chicago|       4|
+---------+--------+--------+
only showing top 2 rows

In [46]:
# rename common columns of second spark dataframe.

In [47]:
sdfb2 = sdfb.withColumnRenamed('code','code_box')
sdfb2.show(2)

+--------+--------+-----+---------+
|code_box|contents|value|warehouse|
+--------+--------+-----+---------+
|    0MN7|   Rocks|180.0|        3|
|    4H8P|   Rocks|250.0|        1|
+--------+--------+-----+---------+
only showing top 2 rows

In [48]:
# now join two spark dataframes which have different column names.

In [49]:
sdf = sdfw2.join(sdfb2,sdfw2.code_ware==sdfb2.warehouse)
sdf.show()

+---------+-------------+--------+--------+--------+-----+---------+
|code_ware|     location|capacity|code_box|contents|value|warehouse|
+---------+-------------+--------+--------+--------+-----+---------+
|        1|      Chicago|       3|    4H8P|   Rocks|250.0|        1|
|        1|      Chicago|       3|    7G3H|   Rocks|200.0|        1|
|        1|      Chicago|       3|    8JN6|  Papers| 75.0|        1|
|        1|      Chicago|       3|    P0H6|Scissors|125.0|        1|
|        3|     New York|       7|    0MN7|   Rocks|180.0|        3|
|        3|     New York|       7|    8Y6U|  Papers| 50.0|        3|
|        5|San Francisco|       8|    TU55|  Papers| 90.0|        5|
|        4|  Los Angeles|       2|    4RT3|Scissors|190.0|        4|
|        4|  Los Angeles|       2|    LL08|   Rocks|140.0|        4|
|        2|      Chicago|       4|    9J6F|  Papers|175.0|        2|
|        2|      Chicago|       4|    P2T6|Scissors|150.0|        2|
+---------+-------------+--------+--------+--------+-----+---------+

## spark dataframe attributes

In [25]:
bp.show_method_attributes(sdfw,4)
# count, fillna, filter, where, groubpy, first, corr,
# missing than pandas: max, min, sum, etc.

,0,1,2,3
0,agg,dropDuplicates,join,sortWithinPartitions
1,alias,drop_duplicates,limit,sql_ctx
2,approxQuantile,dropna,localCheckpoint,stat
3,cache,dtypes,na,storageLevel
4,checkpoint,exceptAll,orderBy,subtract
5,coalesce,explain,persist,summary
6,colRegex,fillna,printSchema,take
7,collect,filter,randomSplit,toDF
8,columns,first,rdd,toJSON
9,corr,foreach,registerTempTable,toLocalIterator
10,count,foreachPartition,repartition,toPandas
11,cov,freqItems,repartitionByRange,union
12,createGlobalTempView,groupBy,replace,unionAll
13,createOrReplaceGlobalTempView,groupby,rollup,unionByName
14,createOrReplaceTempView,head,sample,unpersist
15,createTempView,hint,sampleBy,where
16,crossJoin,intersect,schema,withColumn
17,crosstab,intersectAll,select,withColumnRenamed
18,cube,isLocal,selectExpr,withWatermark
19,describe,isStreaming,show,write
20,distinct,is_cached,sort,writeStream
21,drop,,,

# Create SQL table from spark dataframes

- https://spark.apache.org/docs/2.2.0/sql-programming-guide.html

**Global Temporary View** 

Temporary views in Spark SQL are session-scoped and will disappear if the session that creates it terminates. If you want to have a temporary view that is shared among all sessions and keep alive until the Spark application terminates, you can create a global temporary view. Global temporary view is tied to a system preserved database global_temp, and we must use the qualified name to refer it, e.g. `SELECT * FROM global_temp.view1`.

In [109]:
# Register the DataFrame as a SQL temporary view
sdfw.createOrReplaceTempView("Warehouses")
sdfb.createOrReplaceTempView("Boxes")
sdf.createOrReplaceTempView("sdf")

spark.sql('select * from Warehouses limit 2').show()

+----+--------+--------+
|code|location|capacity|
+----+--------+--------+
|   1| Chicago|       3|
|   2| Chicago|       4|
+----+--------+--------+

# Exercise Questions

## 1. Select all warehouses.

In [28]:
%%sql
select * from Warehouses

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(1, 'Chicago', 3),
 (2, 'Chicago', 4),
 (3, 'New York', 7),
 (4, 'Los Angeles', 2),
 (5, 'San Francisco', 8)]

## 2. Select all boxes with a value larger than 150.

In [33]:
# sdfb[sdfb['Value']>150].show()

In [30]:
%%sql
select * from Boxes where value > 150

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[('0MN7', 'Rocks', 180.0, 3),
 ('4H8P', 'Rocks', 250.0, 1),
 ('4RT3', 'Scissors', 190.0, 4),
 ('7G3H', 'Rocks', 200.0, 1),
 ('9J6F', 'Papers', 175.0, 2)]

## 3. Select all distinct contents in all the boxes.

In [36]:
sdfb.select('Contents').distinct().show()

+--------+
|Contents|
+--------+
|   Rocks|
|  Papers|
|Scissors|
+--------+

In [37]:
%%sql
select distinct(contents) from Boxes

 * postgres://postgres:***@localhost:5432/dvdrental
3 rows affected.

[('Scissors',), ('Papers',), ('Rocks',)]

## 4. Select the average value of all the boxes.

In [40]:
sdfb.select(_mean('Value')).show()

+------------------+
|        avg(Value)|
+------------------+
|147.72727272727272|
+------------------+

In [41]:
%%sql
select avg(value) from Boxes

 * postgres://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(147.727272727273,)]

## 5. Select the warehouse code and the average value of the boxes in each warehouse.

In [52]:
dfb.head(2)

   code contents  value  warehouse
0  0MN7    Rocks  180.0          3
1  4H8P    Rocks  250.0          1

In [61]:
# dfb.groupby('warehouse')['value'].mean()

In [62]:
# dfb.groupby('warehouse').agg(mean_value=('value','mean'))

In [59]:
sdfb.groupby('warehouse').agg({'value':'mean'}).show()

+---------+----------+
|warehouse|avg(value)|
+---------+----------+
|        1|     162.5|
|        3|     115.0|
|        5|      90.0|
|        4|     165.0|
|        2|     162.5|
+---------+----------+

In [68]:
%%sql
select warehouse, avg(value) from Boxes group by warehouse

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(3, 115.0), (5, 90.0), (4, 165.0), (2, 162.5), (1, 162.5)]

## 6. Same as previous exercise, but select only those warehouses where the average value of the boxes is greater than 150.

In [70]:
dfb.groupby('warehouse')['value'].mean()[lambda x: x>150]

warehouse
1    162.5
2    162.5
4    165.0
Name: value, dtype: float64

In [73]:
# dfb.groupby('warehouse').filter(lambda dfx: dfx['value'].mean()>150)

In [78]:
sdfb.groupby('warehouse').agg({'value':'mean'}).filter('avg(value)>150').show()

+---------+----------+
|warehouse|avg(value)|
+---------+----------+
|        1|     162.5|
|        4|     165.0|
|        2|     162.5|
+---------+----------+

In [81]:
%%sql
select warehouse, avg(value) as avg_value from Boxes
group by warehouse having avg(value)>150

 * postgres://postgres:***@localhost:5432/dvdrental
3 rows affected.

[(4, 165.0), (2, 162.5), (1, 162.5)]

## 7. Select the code of each box, along with the name of the city the box is located in.

In [84]:
# dfb.head(2)

In [83]:
df.head(2)

   code_ware location  capacity code_box contents  value  warehouse
0          1  Chicago         3     4H8P    Rocks  250.0          1
1          1  Chicago         3     7G3H    Rocks  200.0          1

In [86]:
# df[['code_box','location']]

In [88]:
# sdf.select('code_box','location').show()

In [89]:
%%sql
select b.code as code_box, w.location as location
from Boxes b, Warehouses w
where b.warehouse = w.code

 * postgres://postgres:***@localhost:5432/dvdrental
11 rows affected.

[('0MN7', 'New York'),
 ('4H8P', 'Chicago'),
 ('4RT3', 'Los Angeles'),
 ('7G3H', 'Chicago'),
 ('8JN6', 'Chicago'),
 ('8Y6U', 'New York'),
 ('9J6F', 'Chicago'),
 ('LL08', 'Los Angeles'),
 ('P0H6', 'Chicago'),
 ('P2T6', 'Chicago'),
 ('TU55', 'San Francisco')]

## 8. Select the warehouse codes, along with the number of boxes in each warehouse. Optionally, take into account that some warehouses are empty (i.e., the box count should show up as zero, instead of omitting the warehouse from the result).

In [94]:
# dfb

In [95]:
# dfb.groupby('warehouse')['code'].count()

In [97]:
# sdfb.groupby('warehouse').agg({'code':'count'}).show()

In [99]:
%%sql
select warehouse, count(*) from Boxes group by warehouse

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(3, 2), (5, 1), (4, 2), (2, 2), (1, 4)]

In [100]:
%%sql
/* taking into account nulls */
select w.code, count(w.code)
from Warehouses w
left join Boxes b
on w.code = b.warehouse
group by w.code

 * postgres://postgres:***@localhost:5432/dvdrental
5 rows affected.

[(2, 2), (3, 2), (5, 1), (4, 2), (1, 4)]

## 9. Select the codes of all warehouses that are saturated (a warehouse is saturated if the number of boxes in it is larger than the warehouse's capacity).

In [104]:
df['num_boxes_ware'] = df.groupby('warehouse')['code_box'].transform('count')
df.head(2)

,code_ware,location,capacity,code_box,contents,value,warehouse,num_boxes_ware
0,1,Chicago,3,4H8P,Rocks,250.0,1,4
1,1,Chicago,3,7G3H,Rocks,200.0,1,4

In [121]:
df[df.num_boxes_ware>df.capacity]['code_ware'].unique()

array([1])

In [108]:
# spark does not have groupby transform
# https://github.com/bhishanpdl/Tutorials_and_Lessons/blob/master/Tutorial_PySpark/z01_pyspark_methods/z01_pyspark_groupby/README.md

In [120]:
spark.sql("""
select code from Warehouses w
where capacity <
(
  select count(*) from Boxes b 
  where b.warehouse = w.code
)

""").show()

+----+
|code|
+----+
|   1|
+----+

In [127]:
# next cell command does not work in pyspark, only work in sql

In [170]:
%%sql
select w.code
from Warehouses w
join Boxes b
on w.code = b.warehouse
group by w.code
having count(b.code) > w.capacity

 * postgres://postgres:***@localhost:5432/dvdrental
1 rows affected.

[(1,)]

In [160]:
spark.sql("""
select w.code
from Warehouses w
join Boxes b
on w.code = b.warehouse
group by w.code
having count(b.code) > first(w.capacity)

""").show()

# NOTE: We need FIRST function inside HAVING clause.

+----+
|code|
+----+
|   1|
+----+

## 10. Select the codes of all the boxes located in Chicago.

In [137]:
# df[df.location=='Chicago']['code_box']

In [136]:
# sdf.filter(_col('location')=='Chicago').select('code_box').distinct().show()

In [135]:
%%sql
select b.code
from Warehouses w
right join Boxes b
on w.code=b.warehouse
where w.location='Chicago'

 * postgres://postgres:***@localhost:5432/dvdrental
6 rows affected.

[('4H8P',), ('7G3H',), ('8JN6',), ('9J6F',), ('P0H6',), ('P2T6',)]

In [138]:
%sql select * from Boxes limit 1;

 * postgres://postgres:***@localhost:5432/dvdrental
1 rows affected.

[('0MN7', 'Rocks', 180.0, 3)]

In [141]:
%%sql
select code from Boxes
where warehouse in (
    select code from Warehouses where location='Chicago'
)

 * postgres://postgres:***@localhost:5432/dvdrental
6 rows affected.

[('4H8P',), ('7G3H',), ('8JN6',), ('9J6F',), ('P0H6',), ('P2T6',)]

In [145]:
spark.sql("""
select b.code
from Warehouses w
right join Boxes b
on w.code=b.warehouse
where w.location='Chicago'
""").take(1)

[Row(code='4H8P')]

In [146]:
spark.sql("""
select code from Boxes
where warehouse in (
    select code from Warehouses where location='Chicago'
)
""").take(1)

[Row(code='4H8P')]

## 11. Create a new warehouse in New York with a capacity for 3 boxes.

In [147]:
"""
 INSERT 
   INTO Warehouses
        (Location,Capacity)
 VALUES ('New York',3);
""";

## 12. Create a new box, with code "H5RT", containing "Papers" with a value of 200, and located in warehouse 2.

In [149]:
"""
 INSERT INTO Boxes
   VALUES('H5RT','Papers',200,2);

""";

## 13. Reduce the value of all boxes by 15%.

In [150]:
"""
UPDATE Boxes SET Value = Value * 0.85;

""";

## 14. Apply a 20% value reduction to boxes with a value larger than the average value of all the boxes.

In [151]:
dfb

    code  contents  value  warehouse
0   0MN7     Rocks  180.0          3
1   4H8P     Rocks  250.0          1
2   4RT3  Scissors  190.0          4
3   7G3H     Rocks  200.0          1
4   8JN6    Papers   75.0          1
5   8Y6U    Papers   50.0          3
6   9J6F    Papers  175.0          2
7   LL08     Rocks  140.0          4
8   P0H6  Scissors  125.0          1
9   P2T6  Scissors  150.0          2
10  TU55    Papers   90.0          5

In [152]:
dfb['value'].mean()

147.72727272727272

In [153]:
dfb['discounted_value'] = np.where(dfb['value']>dfb['value'].mean(),
                                  dfb['value']*0.8,
                                  dfb['value'])

dfb

    code  contents  value  warehouse  discounted_value
0   0MN7     Rocks  180.0          3             144.0
1   4H8P     Rocks  250.0          1             200.0
2   4RT3  Scissors  190.0          4             152.0
3   7G3H     Rocks  200.0          1             160.0
4   8JN6    Papers   75.0          1              75.0
5   8Y6U    Papers   50.0          3              50.0
6   9J6F    Papers  175.0          2             140.0
7   LL08     Rocks  140.0          4             140.0
8   P0H6  Scissors  125.0          1             125.0
9   P2T6  Scissors  150.0          2             120.0
10  TU55    Papers   90.0          5              90.0

In [156]:
m = sdfb.select(F.mean('value')).collect()[0][0]
m

147.72727272727272

In [159]:
sdfb.withColumn('discounted_value',
                F.when( F.col('value') > m,
                        F.col('value')*0.8
                      )
                .otherwise(F.col('value'))
               ).show()

+----+--------+-----+---------+----------------+
|code|contents|value|warehouse|discounted_value|
+----+--------+-----+---------+----------------+
|0MN7|   Rocks|180.0|        3|           144.0|
|4H8P|   Rocks|250.0|        1|           200.0|
|4RT3|Scissors|190.0|        4|           152.0|
|7G3H|   Rocks|200.0|        1|           160.0|
|8JN6|  Papers| 75.0|        1|            75.0|
|8Y6U|  Papers| 50.0|        3|            50.0|
|9J6F|  Papers|175.0|        2|           140.0|
|LL08|   Rocks|140.0|        4|           140.0|
|P0H6|Scissors|125.0|        1|           125.0|
|P2T6|Scissors|150.0|        2|           120.0|
|TU55|  Papers| 90.0|        5|            90.0|
+----+--------+-----+---------+----------------+

In [161]:
"""
UPDATE Boxes SET Value = Value * 0.80
   WHERE Value > (SELECT AVG(Value) FROM (SELECT * FROM Boxes) AS X);

""";

## 15. Remove all boxes with a value lower than 100.

In [164]:
# dfb[dfb['value']>100]

   code  contents  value  warehouse  discounted_value
0  0MN7     Rocks  180.0          3             144.0
1  4H8P     Rocks  250.0          1             200.0
2  4RT3  Scissors  190.0          4             152.0
3  7G3H     Rocks  200.0          1             160.0
6  9J6F    Papers  175.0          2             140.0
7  LL08     Rocks  140.0          4             140.0
8  P0H6  Scissors  125.0          1             125.0
9  P2T6  Scissors  150.0          2             120.0

In [167]:
# sdfb[sdfb['value']>100].show()

In [168]:
"""
 DELETE FROM Boxes WHERE Value < 100;
""";

## 16. Remove all boxes from saturated warehouses.

In [174]:
# df[df.num_boxes_ware > df.capacity]

In [175]:
"""
 DELETE FROM Boxes WHERE Warehouse IN
   (
     SELECT Code
       FROM Warehouses
       WHERE Capacity <
       (
         SELECT COUNT(*)
           FROM Boxes
           WHERE Warehouse = Warehouses.Code
       )
   );
""";